from pyspark.sql import SparkSession, DataFrame, functions as F

spark = SparkSession.builder.appName("show_csv").master("local[*]").getOrCreate()
df = spark.read.csv("traffic_data_partitioned/date=2025-08-31/part-00000-39ed7dd5-dddf-4259-ad85-f3af27d3c4e6.c000.csv.snappy", header=True)
print(df.show(20))

invalid_data = df.filter(F.col("valid") == "N")
print(invalid_data.show(10))

'''
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/11/11 00:11:53 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
+-----------+----------+-----------+---------+-----+-----+------+------------------+--------------------+--------------------+--------+--------------------+-------------------------------+-------------------------------+--------+---------------+----------------+
|detector_id| direction|    lane_id|occupancy|speed|valid|volume|standard_deviation|         period_from|           period_to|District|             Road_EN|                        Road_TC|                        Road_SC|Rotation|GeometryEasting|GeometryNorthing|
+-----------+----------+-----------+---------+-----+-----+------+------------------+--------------------+--------------------+--------+--------------------+-------------------------------+-------------------------------+--------+---------------+----------------+
|   AID01101|South East|  Fast Lane|        0|   97|    Y|     1|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近福群大樓 - 東行|  香港仔海旁道近福群大楼 - 东行|     100|         833758|          812147|
|   AID01101|South East|  Fast Lane|        1|   75|    Y|     1|                 0|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近福群大樓 - 東行|  香港仔海旁道近福群大楼 - 东行|     100|         833758|          812147|
|   AID01101|South East|Middle Lane|        1|   72|    Y|     2|               6.4|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近福群大樓 - 東行|  香港仔海旁道近福群大楼 - 东行|     100|         833758|          812147|
|   AID01101|South East|Middle Lane|        1|   98|    Y|     1|                 0|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近福群大樓 - 東行|  香港仔海旁道近福群大楼 - 东行|     100|         833758|          812147|
|   AID01101|South East|  Slow Lane|        0|   70|    Y|     0|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近福群大樓 - 東行|  香港仔海旁道近福群大楼 - 东行|     100|         833758|          812147|
|   AID01101|South East|  Slow Lane|        0|   70|    Y|     0|                 0|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近福群大樓 - 東行|  香港仔海旁道近福群大楼 - 东行|     100|         833758|          812147|
|   AID01102|North East|  Fast Lane|        0|   70|    Y|     0|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近海暉大廈 - 東行|  香港仔海旁道近海晖大厦 - 东行|      60|         834293|          812041|
|   AID01102|North East|  Fast Lane|        0|   70|    Y|     0|                 0|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近海暉大廈 - 東行|  香港仔海旁道近海晖大厦 - 东行|      60|         834293|          812041|
|   AID01102|North East|Middle Lane|        0|   93|    Y|     1|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近海暉大廈 - 東行|  香港仔海旁道近海晖大厦 - 东行|      60|         834293|          812041|
|   AID01102|North East|Middle Lane|        1|   79|    Y|     3|              14.4|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近海暉大廈 - 東行|  香港仔海旁道近海晖大厦 - 东行|      60|         834293|          812041|
|   AID01102|North East|  Slow Lane|        0|   70|    Y|     0|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近海暉大廈 - 東行|  香港仔海旁道近海晖大厦 - 东行|      60|         834293|          812041|
|   AID01102|North East|  Slow Lane|        0|   71|    Y|     1|                 0|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Aberdeen Praya Ro...|  香港仔海旁道近海暉大廈 - 東行|  香港仔海旁道近海晖大厦 - 东行|      60|         834293|          812041|
|   AID01103|South East|  Fast Lane|        0|   69|    Y|     1|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Wong Chuk Hang Ro...|黃竹坑道近香港仔工業學校 - 東行|黄竹坑道近香港仔工业学校 - 东行|      80|         834750|          812208|
|   AID01103|South East|  Fast Lane|        2|   68|    Y|     5|              12.5|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Wong Chuk Hang Ro...|黃竹坑道近香港仔工業學校 - 東行|黄竹坑道近香港仔工业学校 - 东行|      80|         834750|          812208|
|   AID01103|South East|Middle Lane|        4|   73|    Y|     4|              12.3|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Wong Chuk Hang Ro...|黃竹坑道近香港仔工業學校 - 東行|黄竹坑道近香港仔工业学校 - 东行|      80|         834750|          812208|
|   AID01103|South East|Middle Lane|        5|   62|    Y|     5|              19.8|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Wong Chuk Hang Ro...|黃竹坑道近香港仔工業學校 - 東行|黄竹坑道近香港仔工业学校 - 东行|      80|         834750|          812208|
|   AID01103|South East|  Slow Lane|        0|   50|    Y|     0|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Wong Chuk Hang Ro...|黃竹坑道近香港仔工業學校 - 東行|黄竹坑道近香港仔工业学校 - 东行|      80|         834750|          812208|
|   AID01103|South East|  Slow Lane|        4|   20|    Y|     1|                 0|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Wong Chuk Hang Ro...|黃竹坑道近香港仔工業學校 - 東行|黄竹坑道近香港仔工业学校 - 东行|      80|         834750|          812208|
|   AID01104|North East|  Fast Lane|        5|   59|    Y|     3|                14|2025-08-31T06:37:...|2025-08-31T06:37:...|Southern|Wong Chuk Hang Ro...|黃竹坑道行車天橋近安盛匯 - 東行|黄竹坑道行车天桥近安盛汇 - 东行|      60|         835128|          812179|
|   AID01104|North East|  Fast Lane|        1|   69|    Y|     4|              10.2|2025-08-31T22:48:...|2025-08-31T22:48:...|Southern|Wong Chuk Hang Ro...|黃竹坑道行車天橋近安盛匯 - 東行|黄竹坑道行车天桥近安盛汇 - 东行|      60|         835128|          812179|
+-----------+----------+-----------+---------+-----+-----+------+------------------+--------------------+--------------------+--------+--------------------+-------------------------------+-------------------------------+--------+---------------+----------------+
only showing top 20 rows
None
+-----------+----------+-----------+---------+-----+-----+------+------------------+--------------------+--------------------+------------+--------------------+----------------------------------+----------------------------------+--------+---------------+----------------+
|detector_id| direction|    lane_id|occupancy|speed|valid|volume|standard_deviation|         period_from|           period_to|    District|             Road_EN|                           Road_TC|                           Road_SC|Rotation|GeometryEasting|GeometryNorthing|
+-----------+----------+-----------+---------+-----+-----+------+------------------+--------------------+--------------------+------------+--------------------+----------------------------------+----------------------------------+--------+---------------+----------------+
|   AID01120|     North|  Fast Lane|        1|   86|    N|     2|               2.1|2025-08-31T06:37:...|2025-08-31T06:37:...|Kowloon City|Waterloo Road nea...|     窩打老道近九龍東軍營(1)- 北行|    窝打老道近九龙东军营(1) - 北行|       0|         836475|          821768|
|   AID01120|     North|Middle Lane|        0|   76|    N|     1|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|Kowloon City|Waterloo Road nea...|     窩打老道近九龍東軍營(1)- 北行|    窝打老道近九龙东军营(1) - 北行|       0|         836475|          821768|
|   AID01120|     North|  Slow Lane|        7|   53|    N|     4|              12.8|2025-08-31T06:37:...|2025-08-31T06:37:...|Kowloon City|Waterloo Road nea...|     窩打老道近九龍東軍營(1)- 北行|    窝打老道近九龙东军营(1) - 北行|       0|         836475|          821768|
|   AID03118|North West|  Fast Lane|        0|  100|    N|     0|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|   Yuen Long|Tsing Long Highwa...|青朗公路近港鐵八鄉維修中心 - 北...|青朗公路近港铁八乡维修中心 - 北...|     330|         824640|          832089|
|   AID03118|North West|Middle Lane|        0|  100|    N|     0|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|   Yuen Long|Tsing Long Highwa...|青朗公路近港鐵八鄉維修中心 - 北...|青朗公路近港铁八乡维修中心 - 北...|     330|         824640|          832089|
|   AID03118|North West|  Slow Lane|        1|   88|    N|     1|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|   Yuen Long|Tsing Long Highwa...|青朗公路近港鐵八鄉維修中心 - 北...|青朗公路近港铁八乡维修中心 - 北...|     330|         824640|          832089|
|   AID03203|South East|  Fast Lane|        0|  110|    N|     1|                 0|2025-08-31T22:48:...|2025-08-31T22:48:...|Sham Shui Po|West Kln Hwy near...|         西九龍公路近海麗邨 - 南行|         西九龙公路近海丽邨 - 南行|     120|         832477|          821531|
|   AID03203|South East|Middle Lane|        1|   93|    N|     2|               6.4|2025-08-31T22:48:...|2025-08-31T22:48:...|Sham Shui Po|West Kln Hwy near...|         西九龍公路近海麗邨 - 南行|         西九龙公路近海丽邨 - 南行|     120|         832477|          821531|
|   AID03203|South East|  Slow Lane|        3|   83|    N|     3|              12.3|2025-08-31T22:48:...|2025-08-31T22:48:...|Sham Shui Po|West Kln Hwy near...|         西九龍公路近海麗邨 - 南行|         西九龙公路近海丽邨 - 南行|     120|         832477|          821531|
|   AID09115|      East|  Fast Lane|        0|   63|    N|     1|                 0|2025-08-31T06:37:...|2025-08-31T06:37:...|        NULL|                NULL|                              NULL|                              NULL|    NULL|           NULL|            NULL|
+-----------+----------+-----------+---------+-----+-----+------+------------------+--------------------+--------------------+------------+--------------------+----------------------------------+----------------------------------+--------+---------------+----------------+
only showing top 10 rows
None
'''